In [15]:
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker
from sqlalchemy import Column
from sqlalchemy import String
from sqlalchemy import Integer
from sqlalchemy import Date

import pandas as pd

In [18]:
#establish database path
database_path = 'postgres://postgres:password@localhost:5432/SQL_Challenge'

#create engine
engine = create_engine(f'postgresql://{database_path}')
conn = engine.connect()

#read sql into pandas (test)
data = pd.read_sql("select * from salaries", conn)

In [19]:
data.head()

  emp_no  salary   from_date     to_date
0  10001   60117  1986-06-26  1987-06-26
1  10002   65828  1996-08-03  1997-08-03
2  10003   40006  1995-12-03  1996-12-02
3  10004   40054  1986-12-01  1987-12-01
4  10005   78228  1989-09-12  1990-09-12

In [20]:
#read sql into pandas (average salary based on title)
data1 = pd.read_sql("select t.title, round(avg(s.salary)::numeric,2) as average_salary from salaries as s left outer join titles as t on s.emp_no = t.emp_no group by t.title;", conn)

print (data1)

                title  average_salary
0  Assistant Engineer        48493.20
1            Engineer        48539.78
2             Manager        51531.04
3     Senior Engineer        48506.75
4        Senior Staff        58503.29
5               Staff        58465.27
6    Technique Leader        48580.51